{
  "SNACKBAR": {
    "AUTH_MODAL": {
      "REGISTER": {
        "TITLE": "춰Bienvenido!",
        "DESC": "Te hemos enviado un email para verificar tu cuenta"
      },
      "LOGIN": {
        "TITLE": "춰Bienvenido de nuevo!",
        "DESC": "Redirigiendo a tu perfil, por favor espera un momento..."
      },
      "LOGIN_OTP": {
        "TITLE": "Se requiere verificaci칩n por OTP",
        "DESC": "Te hemos enviado un email con un c칩digo. 춰Por favor, rev칤salo!"
      },
      "FORGOT_PASSWORD": {
        "TITLE": "Asistencia de contrase침a recibida",
        "DESC": "Te hemos enviado un email con instrucciones"
      }
    },
    "OTP_MODAL": {
      "TITLE": "OTP Verificado",
      "DESC": "Redirigiendo a tu perfil, por favor espera un momento..."
    }
  },
  "LANDING": {
    "NAVBAR": {
      "PLAY": "Jugar Partida",
      "TOURNAMENTS": "Torneos",
      "LOGIN": "Entrar"
    },
    "PLAY": {
      "TITLE": "juega PVP pong gratis",
      "SUBTITLE": "Juega contra tus amigos en modo local u organiza torneos locales de hasta 32 jugadores"
    },
    "DISCOVER": {
      "HEADER": "REDES SOCIALES",
      "TITLE": "Descubre Personas Y Haz Amigos",
      "SUBTITLE": "Env칤a solicitudes de amistad y chatea con personas de todo el mundo con las que juegas"
    },
    "LEADER_BOARD": {
      "HEADER": "COMPITE A NIVEL MUNDIAL",
      "TITLE": "S칠 El Mejor Jugador En El Tablero De L칤deres",
      "SUBTITLE": "Compite en juegos en l칤nea y gana puntos. </br>Convi칠rtete en el mejor jugador de Pong del mundo"
    },
    "TEAM": {
      "HEADER": "CONOCE AL EQUIPO",
      "TITLE": "Las Mentes Detr치s Del C칩digo"
    },
    "GET_STARTED": {
      "HEADER": "쯃isto para demostrar </br> de qu칠 est치s hecho?",
      "TITLE": "S칠 parte de esta </br>comunidad"
    },
    "FOOTER": {
      "COPYRIGHT": "춸 Copyright 2024. Todos los derechos reservados",
      "LEGAL_NOTICE": "Aviso Legal",
      "PRIVACY_POLICY": "Pol칤tica de Privacidad",
      "TERMS_CONDITIONS": "T칠rminos y Condiciones"
    },
    "BUTTONS": {
      "LOCAL_MODE": "Probar en local",
      "CREATE_TOURNAMENT": "crear un torneo",
      "DISCOVER": "Conocer gente nueva",
      "REGISTER": "Registrarse",
      "REGISTER_NOW": "Reg칤strate ahora",
      "42_ACCOUNT": "42 Network",
      "GET_STARTED": "Empezar",
      "LOGIN": "Entrar",
      "LOGIN_NOW": "Entrar ahora",
      "SIGN_UP": "Reg칤strate",
      "FORGOT_PASSWORD": "Enviar instrucciones"
    },
    "FORMS": {
      "USERNAME": "Nombre de usuario",
      "EMAIL": "Correo electr칩nico",
      "EMAIL_OR_USERNAME": "Correo o nombre de usuario",
      "EMAIL_USERNAME_PHOLDER": "Identif칤cate",
      "PASSWORD": "Contrase침a",
      "PASSWORD_PHOLDER": "Tu contrase침a",
      "CONFIRM_PASSWORD": "Confirmar contrase침a",
      "CONFIRM_PASSWORD_PHOLDER": "Confirma tu contrase침a"
    },
    "REGISTER": {
      "TERMS": "Acepto los <a href='/terms-conditions' class='terms-link' rel='noreferrer' target='_blank'>T칠rminos y Condiciones</a>",
      "OPTION_TEXT": "- O REG칈STRATE CON -"
    },
    "LOGIN": {
      "SIGN_IN": "Iniciar sesi칩n",
      "FORGOT_PASSWORD": "쯆lvidaste tu contrase침a?",
      "OPTION_TEXT": "- O INICIA SESI칍N CON -"
    },
    "FORGOT_PASSWORD": {
      "TITLE": "Asistencia de contrase침a",
      "DESC": "Introduce tu correo o usuario y te enviaremos instrucciones sobre c칩mo restablecer tu contrase침a."
    },
    "OTP": {
      "TITLE": "Se requiere verificaci칩n OTP",
      "DESC": "Te hemos enviado un email con una contrase침a de un solo uso.</br>Por favor, inserte el c칩digo en el siguiente campo de entrada",
      "BUTTON_TITLE": "Verificar c칩digo"
    }
  },
  "LEGAL_COMMON_DATA": {
    "EMAIL": "<strong>Correo Electr칩nico:</strong> pongtrancendence@gmail.com",
    "ENTERPRISE": "<strong>Nombre de la Empresa:</strong> Transcendence",
    "ADDRESS": "<strong>Direcci칩n:</strong> Av de Sor Teresa Prat, 15, Carretera de C치diz, 29003 M치laga",
    "POSTAL_ADDRESS": "<strong>Direcci칩n Postal:</strong> Av de Sor Teresa Prat, 15, Carretera de C치diz, 29003 M치laga",
    "NIF": "<strong>NIF/CIF:</strong> 12345678A",
    "TELEPHONE": "<strong>Tel칠fono de Contacto:</strong> +34123456789" 
  },
  "PRIVACY": {
    "TITLE": "Pol칤tica de Privacidad",
    "UPDATED": "<strong>칔ltima actualizaci칩n:</strong> 02/09/2024",
    "INTRO": "En <strong>Transcendence</strong> ('nosotros', 'nuestro', 'la Empresa'), respetamos y protegemos la privacidad de nuestros usuarios. Esta Pol칤tica de Privacidad explica c칩mo manejamos la informaci칩n personal en nuestro sitio web <strong>Transcendence</strong>.",
    "SECTION_1": {
      "TITLE": "1. Responsable del Tratamiento de Datos",
      "CONTENT": "El responsable del tratamiento de datos personales en este sitio web es:"
    },
    "SECTION_2": {
      "TITLE": "2. Recopilaci칩n de Datos Personales",
      "CONTENT": "Recopilamos la direcci칩n de correo electr칩nico de los usuarios de forma obligatoria al momento de registrarse en nuestro sitio web. Adem치s, los usuarios pueden optar por proporcionarnos su direcci칩n de correo electr칩nico de manera voluntaria al enviarnos un correo electr칩nico a la direcci칩n indicada en esta Pol칤tica de Privacidad. No recopilamos ninguna otra informaci칩n personal identificable, como nombres, direcciones f칤sicas o n칰meros de tel칠fono."
    },
    "SECTION_3": {
      "TITLE": "3. Uso de Cookies",
      "CONTENT": "Nuestro sitio web no utiliza cookies ni otras tecnolog칤as de seguimiento para recopilar informaci칩n sobre los visitantes. Esto incluye tanto cookies propias como de terceros."
    },
    "SECTION_4": {
      "TITLE": "4. Enlaces a Sitios Web de Terceros",
      "CONTENT": "Nuestro sitio web puede contener enlaces a otros sitios web que no son operados por nosotros. Si haces clic en un enlace de terceros, ser치s dirigido al sitio de ese tercero. Te recomendamos revisar la pol칤tica de privacidad de cada sitio que visites. No tenemos control sobre el contenido, las pol칤ticas de privacidad o las pr치cticas de sitios web de terceros y no asumimos responsabilidad alguna por ellos."
    },
    "SECTION_5": {
      "TITLE": "5. Seguridad de los Datos",
      "CONTENT": "Aunque no recopilamos datos personales, hemos implementado medidas de seguridad adecuadas para proteger la informaci칩n que puedas proporcionarnos por otros medios, en concreto a trav칠s de correos electr칩nicos."
    },
    "SECTION_6": {
      "TITLE": "6. Tus Derechos",
      "INTRO": "Como usuario, tienes derecho a:",
      "ACCESS": "<strong>Acceso:</strong> Solicitar informaci칩n sobre cualquier dato personal que pueda haber sido recopilado.",
      "RECTIFICATION": "<strong>Rectificaci칩n:</strong> Pedir la correcci칩n de cualquier dato personal incorrecto.",
      "SUPPRESSION": "<strong>Supresi칩n:</strong> Solicitar la eliminaci칩n de cualquier dato personal que pueda haberse recopilado.",
      "LIMITATION": "<strong>Limitaci칩n:</strong> Restringir el tratamiento de tus datos personales en ciertos casos.",
      "OPPOSITION": "<strong>Oposici칩n:</strong> Oponerte al tratamiento de tus datos personales.",
      "OUTRO": "Si deseas ejercer alguno de estos derechos, por favor, contacta con nosotros a trav칠s de los datos proporcionados en la secci칩n 1."
    },
    "SECTION_7": {
      "TITLE": "7. Cambios en la Pol칤tica de Privacidad",
      "CONTENT": "Podemos actualizar esta Pol칤tica de Privacidad ocasionalmente para reflejar cambios en nuestras pr치cticas o en la legislaci칩n aplicable. Cualquier cambio se publicar치 en esta p치gina y se indicar치 la fecha de la 칰ltima actualizaci칩n."
    },
    "SECTION_8": {
      "TITLE": "8. Contacto",
      "CONTENT": "Si tienes alguna pregunta o inquietud sobre esta Pol칤tica de Privacidad o sobre nuestras pr치cticas, no dudes en contactarnos:"
    }
  },
  "NOTICE": {
    "TITLE": "Aviso Legal",
    "UPDATED": "<strong>칔ltima actualizaci칩n:</strong> 02/09/2024",
    "INTRO": "Este aviso legal regula el uso del sitio web <strong>Transcendence</strong> (en adelante, 'el Sitio Web'), que pone a disposici칩n de los usuarios de Internet la entidad <strong>Transcendence</strong> (en adelante, 'la Empresa').",
    "SECTION_1_TITLE": "1. Datos del Titular del Sitio Web",
    "SECTION_2": {
      "TITLE": "2. Condiciones de Uso",
      "CONTENT": "El acceso y uso del Sitio Web atribuye la condici칩n de 'Usuario' e implica la aceptaci칩n plena y sin reservas de todas y cada una de las disposiciones incluidas en este Aviso Legal, en la versi칩n publicada por la Empresa en el momento mismo en que el Usuario acceda al Sitio Web. Por lo tanto, se recomienda al Usuario leer atentamente este Aviso Legal cada vez que acceda al Sitio Web."
    },
    "SECTION_3": {
      "TITLE": "3. Propiedad Intelectual e Industrial",
      "FIRST_PART": "Todos los contenidos del Sitio Web, entendiendo por estos a t칤tulo enunciativo los textos, fotograf칤as, gr치ficos, im치genes, iconos, tecnolog칤a, software, y dem치s contenidos audiovisuales o sonoros, as칤 como su dise침o gr치fico y c칩digos fuente, son propiedad intelectual de la Empresa o de terceros, sin que puedan entenderse cedidos al Usuario ninguno de los derechos de explotaci칩n sobre ellos m치s all치 de lo estrictamente necesario para el correcto uso del Sitio Web.",
      "SECOND_PART": "Las marcas, nombres comerciales o signos distintivos son titularidad de la Empresa o de terceros, sin que pueda entenderse que el acceso al Sitio Web atribuye ning칰n derecho sobre los mismos."
    },
    "SECTION_4": {
      "TITLE": "4. Exclusi칩n de Responsabilidad",
      "INTRO": "El contenido de este Sitio Web es de car치cter general y tiene una finalidad meramente informativa. La Empresa no garantiza plenamente el acceso a todos los contenidos, ni su exhaustividad, correcci칩n, vigencia o actualidad, ni su idoneidad o utilidad para un objetivo espec칤fico.",
      "CONTENT": {
        "FIRST_PART": "La Empresa no se responsabiliza de los da침os y perjuicios de cualquier naturaleza derivados de:",
        "REASON_1": "La imposibilidad de acceso al Sitio Web o la falta de veracidad, exactitud, exhaustividad y/o actualidad de los contenidos, as칤 como de la existencia de vicios y defectos de toda clase en los contenidos transmitidos, difundidos, almacenados, puestos a disposici칩n a los que se haya accedido a trav칠s del Sitio Web o de los servicios que se ofrecen.",
        "REASON_2": "La presencia de virus u otros elementos en los contenidos que puedan producir alteraciones en los sistemas inform치ticos, documentos electr칩nicos o datos de los Usuarios.",
        "REASON_3": "El incumplimiento de las leyes, la buena fe, el orden p칰blico, los usos del tr치fico y el presente Aviso Legal como consecuencia del uso incorrecto del Sitio Web. En particular, y a modo ejemplificativo, la Empresa no se hace responsable de las actuaciones de terceros que vulneren derechos de propiedad intelectual e industrial, secretos empresariales, derechos al honor, a la intimidad personal y familiar y a la propia imagen, as칤 como la normativa en materia de competencia desleal y publicidad il칤cita."
      }
    },
    "SECTION_5": {
      "TITLE": "5. Enlaces Externos",
      "CONTENT": "Este Sitio Web puede incluir enlaces a sitios web de terceros. La Empresa no asume ninguna responsabilidad por el contenido, pol칤ticas de privacidad o pr치cticas de esos sitios externos. El Usuario accede bajo su exclusiva responsabilidad al contenido de dichos sitios web y debe revisar sus pol칤ticas de privacidad y condiciones de uso."
    },
    "SECTION_6": {
      "TITLE": "6. Protecci칩n de Datos Personales",
      "FIRST_PART": "De conformidad con lo dispuesto en el Reglamento General de Protecci칩n de Datos (GDPR), informamos a los Usuarios que este Sitio Web no recopila datos personales ni utiliza cookies.",
      "SECOND_PART": "Si el Usuario decide contactar con la Empresa a trav칠s de los medios facilitados en este Sitio Web, como el correo electr칩nico o formularios de contacto, sus datos ser치n tratados conforme a nuestra Pol칤tica de Privacidad, disponible en el Sitio Web."
    },
    "SECTION_7": {
      "TITLE": "7. Legislaci칩n Aplicable y Jurisdicci칩n",
      "CONTENT": "Las relaciones establecidas entre la Empresa y el Usuario se regir치n por lo dispuesto en la normativa espa침ola vigente, siendo competentes para resolver cualquier controversia que se derive del acceso o uso de este Sitio Web los juzgados y tribunales de M치laga."
    }
  },
  "TERMS_AND_CONDITIONS": {
    "TITLE": "T칠rminos y Condiciones",
    "UPDATED": "<strong>칔ltima actualizaci칩n:</strong> 02/09/2024",
    "INTRO": "<strong>Transcendence</strong> ('nosotros', 'nuestro') est치 comprometido con la protecci칩n de su privacidad y con la transparencia en el tratamiento de sus datos personales. Para cumplir con el Reglamento General de Protecci칩n de Datos (GDPR), le pedimos su consentimiento expl칤cito para recopilar y tratar los siguientes datos personales cuando crea una cuenta en nuestro sitio web.",
    "SECTION_1": {
      "TITLE": "1. Datos Personales Recogidos",
      "INTRO": "Al crear una cuenta en nuestro sitio web, recopilaremos y trataremos los siguientes datos personales:",
      "DATA": {
        "PICTURES": "<strong>Im치genes:</strong> Se recogen 칰nicamente dos im치genes, una como imagen representativa del usuario y la otra como imagen de fondo para su perfil.",
        "PASSWORD": "<strong>Correo electr칩nico:</strong> Para identificar y comunicarnos con usted.",
        "EMAIL": "<strong>Contrase침a:</strong> Para asegurar el acceso a su cuenta.",
        "USERNAME": "<strong>Nombre de usuario:</strong> Para identificar su cuenta en nuestro sitio.",
        "CODE": "<strong>C칩digo de vinculaci칩n (opcional):</strong> Puede optar por vincular su cuenta con un servicio de terceros (42 en nuestro caso) utilizando un c칩digo de vinculaci칩n."
      }
    },
    "SECTION_2": {
      "TITLE": "2. Finalidad del Tratamiento de los Datos",
      "INTRO": "Sus datos personales ser치n tratados con las siguientes finalidades:",
      "DATA": {
        "PICTURES": "<strong>Im치genes:</strong>Para la personalizaci칩n del perfil de usuario.",
        "EMAIL": "<strong>Correo electr칩nico:</strong> Para gestionar su cuenta y enviar notificaciones relacionadas con el servicio.",
        "PASSWORD": "<strong>Contrase침a:</strong> Para asegurar el acceso a su cuenta de forma confidencial.",
        "USERNAME": "<strong>Nombre de usuario:</strong> Para identificar su cuenta en nuestro sistema y permitirle interactuar con otras funciones del sitio.",
        "CODE": "<strong>C칩digo de vinculaci칩n (opcional):</strong> Para permitir la vinculaci칩n con servicios de terceros, facilitando el acceso y mejorando su experiencia en nuestro sitio web."
      }
    },
    "SECTION_3": {
      "TITLE": "3. Base Legal para el Tratamiento",
      "CONTENT": "El tratamiento de sus datos personales se realiza sobre la base de su consentimiento expl칤cito (Art. 6.1.a GDPR) al marcar la casilla correspondiente y enviar este formulario."
    },
    "SECTION_4": {
      "TITLE": "4. Duraci칩n del Tratamiento de los Datos",
      "CONTENT": "Sus datos personales ser치n conservados mientras su cuenta permanezca activa. Si decide cerrar su cuenta, eliminaremos sus datos personales, salvo que estemos obligados a conservarlos para cumplir con obligaciones legales."
    },
    "SECTION_5": {
      "TITLE": "5. Derechos del Titular de los Datos",
      "INTRO": "Usted tiene derecho a:",
      "LIST": {
        "ELEMENT_1": "Acceder a sus datos personales y obtener una copia de ellos.",
        "ELEMENT_2": "Rectificar cualquier dato inexacto o incompleto.",
        "ELEMENT_3": "Suprimir sus datos personales cuando ya no sean necesarios para los fines para los que fueron recopilados.",
        "ELEMENT_4": "Limitar el tratamiento de sus datos en determinadas circunstancias.",
        "ELEMENT_5": "Portabilidad de sus datos personales a otro responsable del tratamiento.",
        "ELEMENT_6": "Oponerse al tratamiento de sus datos personales en determinadas situaciones."
      },
      "OUTRO": "Para ejercer sus derechos, puede contactarnos en cualquier momento en <strong>pongtrancendence@gmail.com</strong>."
    },
    "SECTION_6": {
      "TITLE": "6. Transferencias Internacionales de Datos",
      "CONTENT": "Sus datos personales no ser치n transferidos fuera del Espacio Econ칩mico Europeo (EEE), salvo que se adopten las medidas de protecci칩n adecuadas conforme a la GDPR."
    },
    "SECTION_7": {
      "TITLE": "7. Consentimiento",
      "CONTENT": "Al marcar la casilla y registrarse, usted consiente de manera libre, espec칤fica, informada e inequ칤voca al tratamiento de sus datos personales tal como se describe en esta pol칤tica."
    }
  },
  "SIDEBAR": {
    "PLAY_A_GAME": "Jugar partida",
    "TOURNAMENTS": "Torneos",
    "FRIENDSHIP_REQUEST": "Solicitudes de amistad",
    "RANKING": "Clasificaci칩n",
    "SETTINGS": "Ajustes",
    "LOGOUT": "Cerrar sesi칩n"
  },
  "PROFILE": {
    "SEARCH": "Buscar usuarios...",
    "HEADER": {
      "POSITION": "Posici칩n: ",
      "POINTS": "Puntos: ",
      "STATUS": {
        "CONNECTED": "Disponible",
        "DISCONNECTED": "No disponible"
      }
    },
    "STATS": {
      "TITLE": "Estad칤sticas Globales",
      "GOALS_SCORED": "Goles Marcados",
      "GOALS_AGAINST": "Goles Recibidos",
      "GOALS_STOPPED": "Goles Parados",
      "TIME_PLAYED": "Tiempo Jugado",
      "WINRATE": "Ratio de </br>Victorias", 
      "STREAK": "Max. Racha de </br>Victorias"
    },
    "FRIENDS_LIST_TITLE": "Lista de Amigos",
    "MATCH_HISTORY": {
      "TITLE": "Historial de Partidas",
      "TABLE_HEAD": {
        "RESULT": "Resultado",
        "OPPONENT": "Oponente",
        "EARNED": "Ganado",
        "TIME": "Tiempo"
      },
      "RESULT_STATUS": {
        "VICTORY": "Victoria",
        "DEFEAT": "Derrota",
        "DRAW": "Empate"
      },
      "PAGINATION": {
        "PREVIOUS": "< Anterior",
        "OF": "de",
        "NEXT": "Siguiente >"
      }
    }
  },
  "FRIENDSHIP": {
    "ACCEPT": "Aceptar",
    "REJECT": "Rechazar",
    "NO_MORE_REQUESTS": "No hay m치s solicitudes de amistad...<br/>Vuelve m치s tarde"
  },
  "LEADERBOARD": {
    "TITLE": "TOP 10 jugadores de Pong",
    "POSITION": "Tu posici칩n actual",
    "PTS": " pts"
  },
  "OAUTH": {
    "TITLE": "Conectando con 42.",
    "DESCRIPTION": "Calculando el sentido de la vida..."
  },
  "ERROR": {
    "PAGE": {
      "TITLE": "춰Oh, no!, esto es pong-barazoso...",
      "DESCRIPTION": "Parece que nuestras pelotas de pong se han perdido en el ciberespacio."
    },
    "USERNAME": {
      "REQUIRED": "El usuario es obligatorio",
      "LENGTH": "El usuario debe tener entre 3 y 20 caracteres",
      "ALREADY_EXISTS": "Este usuario ya est치 en uso",
      "INVALID": "El usuario debe ser alfanum칠rico y puede incluir guiones"
    },
    "EMAIL": {
      "REQUIRED": "El correo electr칩nico es obligatorio",
      "ALREADY_EXISTS": "Este correo electr칩nico ya est치 en uso",
      "INVALID": "Formato de correo electr칩nico no v치lido"
    },
    "PASSWORD": {
      "REQUIRED": "La contrase침a es obligatoria",
      "REQUIRED_CONFIRM": "Confirmar contrase침a es obligatorio",
      "DONT_MATCH": "Las contrase침as no coinciden",
      "TOO_SIMILAR": "La contrase침a y el nombre de usuario son demasiado similares",
      "TOO_SHORT": "La contrase침a debe tener al menos 8 caracteres",
      "TOO_COMMON": "La contrase침a es demasiado com칰n",
      "ENTIRELY_NUMERIC": "La contrase침a no puede ser solo n칰meros"
    },
    "USER": {
      "INVALID_LOGIN": "Nombre de usuario o contrase침a no v치lidos",
      "NOT_VERIFIED": "El usuario no est치 verificado",
      "PASS_RESET": "No hay ning칰n usuario o correo electr칩nico que coincida con el dato proporcionado",
      "CHECKBOX": "Debes aceptar los t칠rminos y condiciones",
      "NOT_FOUND": "Usuario no encontrado"
    },
    "OAUTH": {
      "NO_CODE": "Uy, 쯣ong qu칠 est치s aqu칤? 游뱂",
      "TOKEN": "Error inesperado al procesar el token de oauth",
      "USER_INFO": "Error inesperado al recuperar la informaci칩n del usuario",
      "EMAIL_EXISTS": "El correo electr칩nico ya est치 en uso en otra cuenta"
    },
    "INVALID_TOKEN": "Token no v치lido",
    "EXPIRED_TOKEN": "Token expirado",
    "OTP_CODE": "C칩digo incorrecto insertado. Por favor, int칠ntalo de nuevo"
  },
  "SETTINGS": {
    "SECTIONS": {
      "USER_MANAGEMENT": "Gesti칩n de Usuarios",
      "CHANGE_PASSWORD": "Cambiar Contrase침a",
      "TWO_FACTOR_AUTH": "Autenticaci칩n </br>de Dos Factores",
      "CHANGE_VISIBILITY": "Actualizar Visibilidad </br>del Perfil",
      "ABOUT": "Acerca de Transcendence",
      "DELETE_ACCOUNT": "Eliminar Cuenta"
    },
    "USER_MANAGEMENT": {
      "USERNAME": "Nombre de Usuario",
      "USERNAME_PHOLD": "Tu nuevo nombre de usuario",
      "PROFILE_IMG": "Imagen de Perfil",
      "INPUT_FILE_PHOLD": "Subir imagen",
      "PROFILE_IMG_PHOLD": "Subir imagen de perfil"
    }
  }
}
